# Mapping 

## map() and applymap()
Mapping is a great way to do element-wise transfomations and other data cleaning operations. Let's see how it works!

Basic imports

In [23]:
# imports
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## The map() method

Let's create a dframe to work with (Highest elevation cities in the world)

In [44]:
# df creation
df = DataFrame({'city':['Bogotà','Quito','Lhasa'],
                    'altitude':[2640, 2850, 3250]})

#Show
df

     city  altitude
0  Bogotà      2640
1   Quito      2850
2   Lhasa      3250

Now let's say we wanted to add a column for the States, we can do that with a mapping.

In [45]:
# set the dictionary to use un the map method
state_map={'Bogotà':'Colombia','Quito':'Equador','Lhasa':'Tibet'}

#### Mapping the df
The **map()** method sed for substituting each value in a **Series** with another value, that may be derived from a function, a dict or a series.

In [46]:
# Now we can map that data to our current df
df['state'] = df['city'].map(state_map)

In [47]:
#Show result
df

     city  altitude     state
0  Bogotà      2640  Colombia
1   Quito      2850   Equador
2   Lhasa      3250     Tibet

Mapping again, adding the population column

In [48]:
# set a new dictionary
population_map = {'Bogotà': 6000000, 'Quito':5000000, 'Lhasa':350000}

In [49]:
# mapping
df['population'] = df['city'].map(population_map)

In [50]:
df

     city  altitude     state  population
0  Bogotà      2640  Colombia     6000000
1   Quito      2850   Equador     5000000
2   Lhasa      3250     Tibet      350000

In [51]:
df['half'] = df['population'].map(lambda x: x/2)

## The applymap() method

Apply a function to a Dataframe elementwise.

This method applies a function that accepts and returns a scalar to every element of a DataFrame.

In [54]:
# not in place
df.applymap(lambda x: len(str(x)))

   city  altitude  state  population  half
0     6         4      8           7     9
1     5         4      7           7     9
2     5         4      5           6     8

In [55]:
# show the original df
df

     city  altitude     state  population       half
0  Bogotà      2640  Colombia     6000000  3000000.0
1   Quito      2850   Equador     5000000  2500000.0
2   Lhasa      3250     Tibet      350000   175000.0

# Exercises!